# BadNosingProfile Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..BadNosingProfile Property
BuiltInFailures..::..SketchFailures Class See Also
---
Stairs nosing profile must have one loop. Wrong profile will not be shown in profiles list in Stairs Type properties.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BadNosingProfile { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BadNosingProfile As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BadNosingProfile {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace